

def main(age):
    if age <= 0:
        return "Забавно, но нужен реальный возраст. Попробуйте ещё раз."
    elif 0 < age < 6:
        return "Вы, должно быть, ходите в детский сад."
    elif 6 <= age <= 18:
        return "Вы, должно быть, учитесь в школе."
    elif 18 < age <= 24:
        return "Вы, должно быть, учитесь в ВУЗе."
    elif 24 < age <= 65:
        return "Вы, должно быть, работаете."
    elif 65 < age <= 115:
        return "Вы, должно быть, на пенсии."
    else:
        return "Обратитесь в книгу рекордов Гиннеса."


if __name__ == '__main__':
    age = float(input("Введите, пожалуйста, Ваш возраст."))
    print(main(age))
